Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles.GetStandardPropertyFileDirectories Method
 Gets the paths where to look for the property files.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<string> GetStandardPropertyFileDirectories()
Public Shared Function GetStandardPropertyFileDirectories As List(Of String)
Return Value
Type: List<String>
The paths where to look for the property files.
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace